<template>
    <div class="app-container">

        <el-button id="testTobos" @click="testTobos" v-model="this.htmlValue">测试</el-button>
        <el-button onclick="htmlvalu()">生成</el-button>
        <el-button @click="testMeod">测试β-二氢大马酮</el-button>
        <div id="htmlValue"></div>
        <div>
            <tinymce v-model="content" :height="350"/>
        </div>
        <div class="editor-content" v-html="content"/>
    </div>
</template>

<script>
    import Tinymce from '@/components/Tinymce'
    import {getDataForName, getDataFirst} from '@/api/tobs'
    import $ from 'jquery'
    function htmlvalu(){
        let jQuery = $("#testTobos").vla();
        $("#htmlValue").html(jQuery);
    }
    $(function () {

    })

    export default {
        name: 'TinymceDemo',
        components: {Tinymce},
        data() {
            return {
                content: '',
                arr : ["紫苏醇", "正丁醇", "愈创木酚", "异戊酸异戊酯", "异戊酸乙酯", "异戊酸肉桂酯", "异戊酸丁酯", "异戊酸苯乙酯", "异戊酸", "异佛尔酮", "异丁香酚甲醚", "异丁酸肉桂酯", "异丁酸苯乙酯", "乙酰乙酸乙酯", "乙酸愈创木酚酯", "乙酸异戊酯", "乙酸异丁酯", "乙酸叶醇酯", "乙酸香叶酯", "乙酸玫瑰酯", "乙酸糠酯", "乙酸己酯", "乙酸茴香酯", "乙酸二氢葛缕酯", "乙酸丙酯", "乙酸苄酯", "乙酸苯乙酯", "乙酸薄荷酯", "乙偶姻", "叶醇", "氧化芳樟醇", "杨梅醛", "辛酸异戊酯", "辛酸乙酯", "香紫苏内酯", "香叶醇", "香兰素", "仙客来醛", "戊酸乙酯", "戊酸丁酯", "戊酸", "顺式茉莉酮", "顺4-庚烯醛", "十一醛", "乳酸乙酯", "乳酸-l-薄荷酯", "乳酸", "肉桂酸异戊酯", "肉桂酸苯乙酯", "肉桂酸", "肉桂醛", "肉桂醇", "茄酮", "苹果酸", "柠檬酸", "柠檬醛", "玫瑰醇", "麦芽酚", "邻甲氧基肉桂醛", "邻氨基苯甲酸甲酯", "糠基硫醇", "糠基甲基硫醚", "糠醇", "金合欢醇", "甲基环戊烯醇酮", "己酸乙酯", "己酸烯丙酯", "己酸戊酯", "茴香醚", "茴香醇", "庚酸乙酯", "覆盆子酮", "二甲基硫醚", "对甲氧基苯乙酮", "对甲氧基苯甲醛", "对甲基苯甲醚", "丁香酚甲醚", "丁酰乳酸丁酯", "丁酸乙酯", "丁酸香叶酯", "丁酸香茅酯", "丁酸戊酯", "丁酸肉桂酯", "丁酸丁酯", "橙花叔醇", "橙花醇", "丙烯基乙基愈创木酚", "丙酸乙酯", "丙酸苄酯", "苯乙酸异戊酯", "苯乙酸乙酯", "苯乙酸香叶酯", "苯乙酸苄酯", "苯乙酸苯乙酯", "苯乙酸", "苯乙醇", "苯甲酸芳樟酯", "苯甲酸苄酯", "苯甲酸","苯甲醇", "薄荷酮", "柏木醇", "γ-辛内酯", "γ-戊内酯", "γ-十一内酯", "γ-壬内酯", "γ-己内酯", "γ-庚内酯", "β-紫罗兰酮", "β-石竹烯", "β-环高柠檬醛", "β-胡萝卜素", "β-大马酮", "α-紫罗兰酮", "α-当归内酯", "d,l-异薄荷酮", "d,l-香茅醇", "d,l-薄荷醇", "6-甲基-5-庚烯-2-酮", "5-乙基-4-羟基-2-甲基-3(2H)-呋喃酮", "5-甲基糠醛", "4-乙基愈创木酚", "4-氧代异佛尔酮", "4-羟基苯甲酸", "4-甲基-5-羟乙基噻唑", "4-苯基-3-丁烯-2-酮", "3-乙基吡啶", "3-甲基戊酸", "2-乙酰噻唑", "2-乙酰呋喃", "2-乙酰吡嗪", "2-乙基吡嗪", "2-甲基戊酸", "2-甲基四氢呋喃-3-酮", "2-甲基庚酸", "2-甲基丁酸乙酯", "2-甲基吡嗪", "2-甲基-5-甲硫基呋喃", "2-庚酮", "2,6-二甲基-5-庚烯醛", "2,5-二甲基吡嗪", "2,3-二乙基-5-甲基吡嗪", "2,3-丁二酮", "2,3,5-三甲基吡嗪", "2-(或5-或6-)甲氧基-3-甲基吡嗪", "1-甲基-2,3-环己二酮", "1,8-桉叶素", "1,4-桉叶素", "紫罗兰叶净油", "孜然油", "中国肉桂皮油", "枣子精制物", "枣子酊", "芸香油", "云南烟草精油", "月桂叶油", "芫荽籽油", "鸢尾凝脂", "鸢尾浸膏", "鸢尾酊", "愈创木油", "依兰依兰油", "烟草美拉德反应物", "亚洲薄荷油", "压榨圆柚油", "压榨柠檬油", "薰衣草油", "缬草根提取物", "小豆蔻籽油", "橡苔浸膏", "香紫苏油", "香叶油", "香柠檬油", "香料烟精油", "香荚兰提取物", "香荚兰豆酊", "香根油", "西红柿浸膏", "西班牙鼠尾草油", "万寿菊油", "吐鲁精油", "土耳其香料烟提取物", "甜小茴香油", "甜小茴香酊", "甜橙油", "苏合香油", "苏合香浸膏", "松针油", "树兰花油", "树兰花浸膏", "树兰花酊", "莳萝油", "沙棘浸膏", "肉豆蔻油", "芹菜籽油", "蒲公英流浸膏", "苹果汁", "啤酒花提取物", "苜蓿提取物","茉莉净油", "茉莉浸膏", "秘鲁精油", "秘鲁浸膏", "美国弗吉尼亚烟草提取物", "玫瑰精油", "麦芽浸膏", "绿茶提取物", "绿茶酊", "罗马春黄菊提取物", "罗马春黄菊花油", "罗汉果酊", "龙蒿油", "留兰香油", "灵香草净油", "李子提取物", "赖百当油树脂", "蜡菊净油", "苦杏仁油", "苦配巴油", "苦橙油", "苦橙花油", "可可提取物", "可可酊", "烤烟烟草精油", "康乃克绿油", "卡南加油", "卡黎油", "咖啡酊", "桔子油", "津巴布韦烟草提取物", "津巴布韦烟草精油", "金雀花净油", "金合欢净油", "椒样薄荷油", "姜油", "黄檀香木油", "黄葵籽油", "葫芦巴油", "葫芦巴提取物", "葫芦巴酊", "黑加仑净油", "杭白菊花酊", "含羞草净油", "桂叶油", "桂皮油", "枸杞子浸膏", "葛缕籽油", "格蓬油", "格蓬提取物", "甘草流浸膏", "弗吉尼亚烟草精油", "蜂胶提取物", "枫茅草油", "防风根油", "独活浸膏", "独活酊", "丁香叶油", "当归根油", "当归根提取物", "当归酊", "除萜圆柚油", "除萜甜橙油", "除萜柠檬油", "除黄肉豆蔻油", "布枯叶油", "柏木油", "白柠檬油", "白肋烟精油", "巴西烟草提取物", "巴西烟草精油", "巴拉圭茶提取物", "巴拉圭茶净油", "八角茴香油", "桉树油", "安息香膏", "棕榈酸", "异戊酸戊酯", "异丁香酚", "异丁酸芳樟酯", "乙酸乙酯", "乙酸芳樟酯", "乙酸橙花酯", "乙基麦芽酚", "香芹酮", "香茅醛", "戊醇", "肉桂酸乙酯", "肉桂酸肉桂酯", "羟基香茅醛", "枯茗醛", "糠醛", "己酸异戊酯", "芳樟醇", "二氢猕猴桃内酯", "丁香酚", "丁酸芳樟酯", "丁酸苯乙酯", "苯乙酮", "苯甲酸异戊酯","苯甲酸乙酯", "薄荷内酯", "γ-癸内酯", "γ-丁内酯", "β-二氢大马酮", "6,10-二甲基-5,9-十一碳二烯-2-酮", "5-乙基-3-羟基-4-甲基-2(5H)-呋喃酮", "4-羟基-2,5-二甲基-3(2H)呋喃酮", "2-乙酰吡咯", "2-乙基-3,5-二甲基吡嗪", "2-甲基丁酸", "2,3-二甲基吡嗪", "2,3,5,6-四甲基吡嗪", "1,3-丁二醇", "云南烟草提取物", "圆叶当归油", "印蒿油", "缬草油", "缬草根酊", "香茅油", "无花果提取物", "吐鲁香膏", "穗薰衣草油", "莳萝籽油", "山楂酊", "葡萄干提取物", "迷迭香油", "梅子提取物", "罗望子浸膏", "朗姆酒", "赖百当精油", "可可蒸馏物", "咖啡提取物", "菊苣提取物", "角豆提取物", "葫芦巴净油", "胡萝卜籽油", "广藿香油", "蜂蜡净油", "枫槭浸膏", "丁香花蕾油", "除萜白柠檬油", "橙花油", "白肋烟浸膏", "安息香精油"],
                htmlValue:''
            }
        },
        methods: {
            testTobos() {
                var paramsFirst = {
                    expid: 1869,
                    pflx: JSON.stringify("表香"),
                    xlzt: JSON.stringify(["烤烟烟香"]),
                    check_val: JSON.stringify(["香气质"]),
                    byyl1: JSON.stringify(["紫苏醇"]),
                    qyyl1: JSON.stringify(["正丁醇"])
                }
                getDataFirst(paramsFirst).then(res=> {
                    this.htmlValue = res;
                }).catch(e=>{
                    this.$message.error(e);
                });
            },
            testMeod(){
                var params = {'xl_name': 'β-二氢大马酮'}
                getDataForName(params).then(res => {
                    console.log(res)
                }).catch(e => {
                    this.$message.error(e);
                })
            }
        }
    }
</script>

<style scoped>
    .editor-content {
        margin-top: 20px;
    }
</style>

